---
type: MechanicalUtils
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 6
tags: [revit-api, class]
---

# MechanicalUtils

`Autodesk.Revit.DB.Mechanical.MechanicalUtils` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | BreakCurve | 2017 | `public static ElementId BreakCurve ( Document document , ElementId ductId , XYZ ptBreak )` |
| Method | ConnectAirTerminalOnDuct | 2014 | `public static bool ConnectAirTerminalOnDuct ( Document document , ElementId airTerminalId , ElementId ductCurveId )` |
| Method | ConnectDuctPlaceholdersAtCross | — | `` |
| Method | ConnectDuctPlaceholdersAtElbow | — | `` |
| Method | ConnectDuctPlaceholdersAtTee | — | `` |
| Method | ConvertDuctPlaceholders | 2012 | `public static ICollection < ElementId > ConvertDuctPlaceholders ( Document document , ICollection < ElementId > placeholderIds )` |